<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"397fd614070c2eb15a062e8ac46ea8c9395b79eb94435c47e337b5cc92a1d5ac","plan_job_ref":"Job Create terraform plan #9 at https://github.com/Emeric-hub/infra-experiments/actions/runs/5272281074","plan_hash":"12b7e2b291ddebace7d378d905d8238f5ccee9c0f96d8be8e6b4dfb3f1e6b007","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __LOCAL-Proxmox/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_vm_qemu.ubuntu-terraform will be created
  + resource "proxmox_vm_qemu" "ubuntu-terraform" {
      + additional_wait           = 5
      + agent                     = 1
      + automatic_reboot          = true
      + balloon                   = 768
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + clone                     = "ubuntu2204-cloud-master"
      + clone_wait                = 10
      + cores                     = 1
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "cpu,memory,network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 2048
      + name                      = "ubuntu-terraform"
      + nameserver                = (known after apply)
      + numa                      = true
      + onboot                    = false
      + oncreate                  = true
      + os_type                   = "ubuntu"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-single"
      + searchdomain              = (known after apply)
      + sockets                   = 2
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + tags                      = "terraform"
      + target_node               = "proxmox"
      + unused_disk               = (known after apply)
      + vcpus                     = 2
      + vlan                      = -1
      + vmid                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + access_ip_v4 = (known after apply)
```
</details>

:memo: Plan generated in [Create terraform plan #9](https://github.com/Emeric-hub/infra-experiments/actions/runs/5272281074)